using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Inventory
{
    // 변수 ---------------------------------------------------------------------------------------    
    // ItemSlot : 아이템 칸 하나
    //      슬롯에 있는 아이템(ItemData)
    //      아이템 갯수(int)

    // 상수 ---------------------------------------------------------------------------------------
    // 인벤토리 기본 크기

    // 프로퍼티  -----------------------------------------------------------------------------------
    // 인벤토리의 크기

    // 함수(주요기능) ------------------------------------------------------------------------------
    // 아이템 추가하기
    // 아이템 버리기(인벤토리 비우기)
    // 아이템 이동하기
    // 아이템 나누기
    // 아이템 사용하기
    // 아이템 장비하기
    // 아이템 정렬

    // 함수(백엔드) --------------------------------------------------------------------------------
    // 적절한 빈 슬롯을 찾아주는 함수
    //  비어있는 슬롯 확인하는 함수
    //  보유하고 있는 칸 수에 맞는 인덱스인지 확인하는 변수
    // 특정 종류의 아이템이 들어있는 슬롯을 찾아주는 함수
}


// ItemData[]   -> ItemDataManager로 처리
// 아이템 이미지 -> ItemData에 추가될 내용
// 아이템 종류   -> ItemData에 추가될 내용