using System.Collections.Generic;
using UnityEngine;

public class ItemSlot
{
    // 변수 ---------------------------------------------------------------------------------------
    // 슬롯에 있는 아이템(ItemData)
    // 아이템 갯수(int)

    // 프로퍼티 ------------------------------------------------------------------------------------
    // 슬롯에 있는 아이템(ItemData)
    // 아이템 갯수(int)

    // 함수 ---------------------------------------------------------------------------------------
    // 슬롯에 아이템을 설정하는 기능
    // 슬롯을 비우는 기능
    // 아이템 갯수를 증가/감소시키는 함수
    // 아이템을 사용하는 함수
    // 아이템을 장비하는 함수
}